configuration/src/InformationRegisters/InteractionsFolderSubjects/InteractionsFolderSubjects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>InteractionsFolderSubjects</name>
  <resources>
    <name>SubjectOf</name>
    <type>
      <types>DefinedType.InteractionSubject</types>
    </type>
  </resources>
  <resources>
    <name>EmailMessageFolder</name>
    <type>
      <types>CatalogRef.EmailMessageFolders</types>
    </type>
  </resources>
  <resources>
    <name>Reviewed</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ReviewAfter</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Interaction</name>
    <type>
      <types>DocumentRef.OutgoingEmail</types>
      <types>DocumentRef.PlannedInteraction</types>
      <types>DocumentRef.IncomingEmail</types>
      <types>DocumentRef.PhoneCall</types>
      <types>DocumentRef.Meeting</types>
      <types>DocumentRef.SMSMessage</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/InteractionsFolderSubjects/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	AdditionalProperties.Insert("RecordStructure", RecordStructure()); // Used by the consumers.
	
EndProcedure

Procedure OnWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not Interactions.CalculateReviewedItems(AdditionalProperties) Then
		Return;
	EndIf;
	
	OldRecord     = AdditionalProperties.RecordStructure;
	NewRecord      = RecordStructure();
	DataForCalculation = New Structure("NewRecord, OldRecord", NewRecord, OldRecord);
	
	If NewRecord.Reviewed <> OldRecord.Reviewed Then
		
		Interactions.CalculateReviewedByFolders(Interactions.TableOfDataForReviewedCalculation(DataForCalculation, "Folder"));
		Interactions.CalculateReviewedBySubjects(Interactions.TableOfDataForReviewedCalculation(DataForCalculation, "SubjectOf"));
		
		Return;

	EndIf;
	
	If NewRecord.Folder <> OldRecord.Folder Then
		
		Interactions.CalculateReviewedByFolders(Interactions.TableOfDataForReviewedCalculation(DataForCalculation, "Folder"));
		
		Return;
		
	EndIf;
	
	If NewRecord.SubjectOf <> OldRecord.SubjectOf Then
		
		Interactions.CalculateReviewedBySubjects(Interactions.TableOfDataForReviewedCalculation(DataForCalculation, "SubjectOf"));
		Return;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

Function RecordStructure()

	ReturnStructure = New Structure;
	ReturnStructure.Insert("SubjectOf", Undefined);
	ReturnStructure.Insert("Folder", Catalogs.EmailMessageFolders.EmptyRef());
	ReturnStructure.Insert("Reviewed", Undefined);
	
	If Filter.Count() = 0 Then
		Return Undefined;
	EndIf;
	
	Query = New Query;
	Query.Text = "SELECT
	|	InteractionsFolderSubjects.SubjectOf,
	|	InteractionsFolderSubjects.EmailMessageFolder AS Folder,
	|	InteractionsFolderSubjects.Reviewed
	|FROM
	|	InformationRegister.InteractionsFolderSubjects AS InteractionsFolderSubjects
	|WHERE
	|	InteractionsFolderSubjects.Interaction = &Interaction";
	
	Query.SetParameter("Interaction", Filter.Interaction.Value);
	
	Result = Query.Execute();
	If Result.IsEmpty() Then
		Return ReturnStructure;
	EndIf;
	
	Selection = Result.Select();
	Selection.Next();
	FillPropertyValues(ReturnStructure, Selection);
	Return ReturnStructure;
	
EndFunction

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
